app/views/book_comments/_count.html.erb

コメント数：<%= @book.book_comments.count %>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]