app/views/users/_profile.html.erb

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 1], ["follow_id", 2], ["LIMIT", 1]]
---
		<% if current_user.following?(user) %>
			<%= form_for(current_user.relationships.find_by(follow_id: user.id), html: { method: :delete }) do |f| %>