app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = @book.id
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaa"], ["user_id", 1], ["book_id", 2], ["created_at", "2020-08-17 03:49:53.813368"], ["updated_at", "2020-08-17 03:49:53.813368"]]

  def destroy
    BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy
    respond_to do |format|
      format.html { redirect_to book_path(params[:book_id]) }
      format.js { @book = Book.find(params[:book_id]) }
---
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 29]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 29], ["book_id", 5], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]