app/controllers/search_controller.rb

  def search
    if params[:search_target] == 'user'
      search_method = params[:search_method]
      user_name = params[:search_word]
      @users = User.search(user_name,search_method)
    elsif params[:search_target] == 'book'
      search_method = params[:search_method]
      book_title = params[:search_word]
      @books = Book.search(book_title,search_method)
---
SELECT "users".* FROM "users" WHERE (name LIKE '%tf0228%')
SELECT "books".* FROM "books" WHERE (title LIKE '%蟹%')