app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "tf"], ["introduction", ""], ["profile_image_id", nil], ["updated_at", "2020-08-16 05:06:50.107908"], ["id", 1]]
---
  def update
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def followings
    @title = "Follow"
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def followers
    @title = "Follower"
    user = User.find(params[:id])
    @users = user.followers.all